<a href="https://colab.research.google.com/github/sejallotliker/python_pandas/blob/main/Section_2_Using_own_data_set_to_use_functions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##Section 2

Course by udemy

making of our own data set

Author: ```Sejal Lotliker```

Date: ```03-06-2021```

In [ ]:
import pandas as pd

In [ ]:
my_data= pd.DataFrame({"A": [None,12,67,34,None],
                      "B": [None,12,67,34,None],
                       "C":[5,40,None,1,90],
                      "D":[65,13,None,None,55]})

In [ ]:
print(my_data)

         A     B     C     D
0  missing   NaN   5.0  65.0
1       12  12.0  40.0  13.0
2       67  67.0   NaN  13.0
3       34  34.0   1.0  13.0
4  missing   NaN  90.0  55.0

In [ ]:
type(my_data)

pandas.core.frame.DataFrame

In [ ]:
my_data.describe()

               A          B         C          D
count   3.000000   3.000000   4.00000   3.000000
mean   37.666667  37.666667  34.00000  44.333333
std    27.682726  27.682726  41.23914  27.592269
min    12.000000  12.000000   1.00000  13.000000
25%    23.000000  23.000000   4.00000  34.000000
50%    34.000000  34.000000  22.50000  55.000000
75%    50.500000  50.500000  52.50000  60.000000
max    67.000000  67.000000  90.00000  65.000000

In [ ]:
my_data.shape

(5, 4)

In [ ]:
my_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       3 non-null      float64
 2   C       4 non-null      float64
 3   D       3 non-null      float64
dtypes: float64(4)
memory usage: 288.0 bytes

In [ ]:
my_data.isnull()

       A      B      C      D
0   True   True  False  False
1  False  False  False  False
2  False  False   True   True
3  False  False  False   True
4   True   True  False  False

In [ ]:
my_data.isnull().sum()

A    2
B    2
C    1
D    2
dtype: int64

#To use functions 
fillna, ffill,, replace,Interpolate

Fillna function

In [ ]:
my_data['A'].fillna("missing", inplace=True)

In [ ]:
my_data

         A     B     C     D
0  missing   NaN   5.0  65.0
1       12  12.0  40.0  13.0
2       67  67.0   NaN  13.0
3       34  34.0   1.0  13.0
4  missing   NaN  90.0  55.0

In [ ]:
my_data['D'].fillna(method="ffill", limit=1, inplace=True)

In [ ]:
my_data

         A     B     C     D
0  missing   NaN   5.0  65.0
1       12  12.0  40.0  13.0
2       67  67.0   NaN  13.0
3       34  34.0   1.0  13.0
4  missing   NaN  90.0  55.0

#Replace function:

To replace the current value in the data set

In [ ]:
my_data.replace(to_replace="missing", value="Sejal", inplace=True, limit=1)

In [ ]:
my_data

       A     B     C     D
0  Sejal   NaN   5.0  65.0
1     12  12.0  40.0  13.0
2     67  67.0   NaN  13.0
3     34  34.0   1.0  13.0
4  Sejal   NaN  90.0  55.0

#Interpolate Function

In [ ]:
my_data.interpolate(method="linear", limit_direction="forward") # No null values will remain

       A     B     C     D
0  Sejal   NaN   5.0  65.0
1     12  12.0  40.0  13.0
2     67  67.0  20.5  13.0
3     34  34.0   1.0  13.0
4  Sejal  34.0  90.0  55.0

In [ ]:
my_data.interpolate(method="linear", limit_direction="backward")

       A     B     C     D
0  Sejal  12.0   5.0  65.0
1     12  12.0  40.0  13.0
2     67  67.0  20.5  13.0
3     34  34.0   1.0  13.0
4  Sejal   NaN  90.0  55.0